flix/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "It was good experience"], ["created_at", "2015-08-31 17:45:13.362197"], ["movie_id", 1], ["name", "abc"], ["stars", 4], ["updated_at", "2015-08-31 17:45:13.362197"]]
---
  def create
    @review = @movie.reviews.new(registration_params)
    if @review.save