flix/app/views/movies/index.html.erb

SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-08-28 16:37:42.234889')  ORDER BY released_on desc
---

<h1> <%= pluralize(@movies.size,'Movie') %></h1>